export default {
  errors: [
    { code: -999, message: "پرداخت توسط کاربر لغو شد." },
    { code: -1, message: "اطلاعات ارسال شده ناقص است." },
    { code: -2, message: "IP و یا مرچنت کد پذیرنده صحیح نیست." },
    {
      code: -3,
      message:
        "با توجه به محدودیت های شاپرک امکان پرداخت با رقم درخواست شده میسر نمی باشد."
    },
    { code: -4, message: "سطح تایید پذیرنده پایین تر از سطح نقره ای است." },
    { code: -11, message: "درخواست مورد نظر یافت نشد." },
    { code: -12, message: "امکان ویرایش درخواست میسر نمی باشد." },
    { code: -21, message: "هیچ نوع عملیات مالی برای این تراکنش یافت نشد." },
    { code: -22, message: "تراکنش نا موفق میباشد." },
    { code: -33, message: "رقم تراکنش با رقم پرداخت شده مطابقت ندارد." },
    {
      code: -34,
      message: "سقف تقسیم تراکنش از لحاظ تعداد یا رقم عبور نموده است"
    },
    { code: -40, message: "اجازه دسترسی به متد مربوطه وجود ندارد." },
    {
      code: -41,
      message: "اطلاعات ارسال شده مربوط به AdditionalData غیرمعتبر میباشد."
    },
    {
      code: -42,
      message:
        "مدت زمان معتبر طول عمر شناسه پرداخت باید بین 30 دقیقه تا 45 روز می باشد."
    },
    { code: -54, message: "درخواست مورد نظر آرشیو شده است." },
    { code: 100, message: "عملیات با موفقیت انجام گردیده است." },
    {
      code: 101,
      message:
        "عملیات پرداخت موفق بوده و قبلا PaymentVerification تراکنش انجام شده است."
    }
  ]
};
